RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_smartcard.h
/** @brief  Disable the SMARTCARD one bit sample method.
  * @param  __HANDLE__ specifies the SMARTCARD Handle.
  * @retval None
  */
#define __HAL_SMARTCARD_ONE_BIT_SAMPLE_DISABLE(__HANDLE__) ((__HANDLE__)->Instance->CR3\
                                                            &= (uint32_t)~((uint32_t)USART_CR3_ONEBIT))

/** @brief  Enable the USART associated to the SMARTCARD Handle.
  * @param  __HANDLE__ specifies the SMARTCARD Handle.
  * @retval None
  */
#define __HAL_SMARTCARD_ENABLE(__HANDLE__)               ((__HANDLE__)->Instance->CR1 |=  USART_CR1_UE)

/** @brief  Disable the USART associated to the SMARTCARD Handle
  * @param  __HANDLE__ specifies the SMARTCARD Handle.
  * @retval None
  */
#define __HAL_SMARTCARD_DISABLE(__HANDLE__)              ((__HANDLE__)->Instance->CR1 &=  ~USART_CR1_UE)

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup SMARTCARD_Private_Macros SMARTCARD Private Macros
  * @{
  */

/** @brief  Report the SMARTCARD clock source.
  * @param  __HANDLE__ specifies the SMARTCARD Handle.
  * @param  __CLOCKSOURCE__ output variable.
  * @retval the SMARTCARD clocking source, written in __CLOCKSOURCE__.
  */
#define SMARTCARD_GETCLOCKSOURCE(__HANDLE__,__CLOCKSOURCE__)  \
  do {                                                        \
    if((__HANDLE__)->Instance == USART1)                      \
    {                                                         \
      switch(__HAL_RCC_GET_USART1_SOURCE())                   \
      {                                                       \
        case RCC_USART1CLKSOURCE_PCLK2:                       \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PCLK2;    \
          break;                                              \
        case RCC_USART1CLKSOURCE_PLL2Q:                       \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PLL2Q;    \
          break;                                              \
        case RCC_USART1CLKSOURCE_PLL3Q:                       \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PLL3Q;    \
          break;                                              \
        case RCC_USART1CLKSOURCE_HSI:                         \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_HSI;      \
          break;                                              \
        case RCC_USART1CLKSOURCE_CSI:                         \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_CSI;      \
          break;                                              \
        case RCC_USART1CLKSOURCE_LSE:                         \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_LSE;      \
          break;                                              \
        default:                                              \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_UNDEFINED;\
          break;                                              \
      }                                                       \
    }                                                         \
    else if(((__HANDLE__)->Instance == USART2) ||             \
            ((__HANDLE__)->Instance == USART3))               \
    {                                                         \
      switch(__HAL_RCC_GET_USART234578_SOURCE())              \
      {                                                       \
        case RCC_USART234578CLKSOURCE_PCLK1:                  \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PCLK1;    \
          break;                                              \
        case RCC_USART234578CLKSOURCE_PLL2Q:                  \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PLL2Q;    \
          break;                                              \
        case RCC_USART234578CLKSOURCE_PLL3Q:                  \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_PLL3Q;    \
          break;                                              \
        case RCC_USART234578CLKSOURCE_HSI:                    \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_HSI;      \
          break;                                              \
        case RCC_USART234578CLKSOURCE_CSI:                    \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_CSI;      \
          break;                                              \
        case RCC_USART234578CLKSOURCE_LSE:                    \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_LSE;      \
          break;                                              \
        default:                                              \
          (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_UNDEFINED;\
          break;                                              \
      }                                                       \
    }                                                         \
    else                                                      \
    {                                                         \
      (__CLOCKSOURCE__) = SMARTCARD_CLOCKSOURCE_UNDEFINED;    \
    }                                                         \
  } while(0U)


/** @brief  Check the Baud rate range.
  * @note   The maximum Baud Rate is derived from the maximum clock on H7RS (100 MHz)
  *         divided by the oversampling used on the SMARTCARD (i.e. 16).
  * @param  __BAUDRATE__ Baud rate set by the configuration function.
  * @retval Test result (TRUE or FALSE)
  */
#define IS_SMARTCARD_BAUDRATE(__BAUDRATE__) ((__BAUDRATE__) < 6250001U)

/** @brief  Check the block length range.
  * @note   The maximum SMARTCARD block length is 0xFF.
  * @param  __LENGTH__ block length.
  * @retval Test result (TRUE or FALSE)
  */
#define IS_SMARTCARD_BLOCKLENGTH(__LENGTH__) ((__LENGTH__) <= 0xFFU)

/** @brief  Check the receiver timeout value.
  * @note   The maximum SMARTCARD receiver timeout value is 0xFFFFFF.
  * @param  __TIMEOUTVALUE__ receiver timeout value.
  * @retval Test result (TRUE or FALSE)
  */
#define IS_SMARTCARD_TIMEOUT_VALUE(__TIMEOUTVALUE__)    ((__TIMEOUTVALUE__) <= 0xFFFFFFU)

